bench/results/server1/2/apiary-0.14.0.1/PARAM.log
Benchmarking PARAM
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.58ms    1.26ms  38.52ms   86.89%
    Req/Sec    18.71k     1.67k   27.42k    72.47%
  1076335 requests in 30.00s, 182.71MB read
Requests/sec:  35878.27
Transfer/sec:      6.09MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.54ms    1.42ms  19.39ms   87.48%
    Req/Sec    18.55k     1.04k   21.55k    74.04%
  1083320 requests in 30.00s, 183.90MB read
Requests/sec:  36110.95
Transfer/sec:      6.13MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.77ms    3.85ms  31.03ms   50.47%
    Req/Sec    18.75k     4.11k   28.62k    60.12%
  1087158 requests in 30.00s, 184.55MB read
Requests/sec:  36238.67
Transfer/sec:      6.15MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.71ms    3.22ms  29.66ms   59.36%
    Req/Sec    18.67k     3.33k   26.60k    57.38%
  1080351 requests in 30.00s, 183.39MB read
Requests/sec:  36011.87
Transfer/sec:      6.11MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.52ms    3.42ms  26.29ms   70.28%
    Req/Sec    18.71k     1.16k   24.06k    72.41%
  1086728 requests in 30.00s, 184.48MB read
Requests/sec:  36224.57
Transfer/sec:      6.15MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.63ms    2.13ms  22.50ms   72.65%
    Req/Sec    18.69k     2.30k   25.69k    63.87%
  1077311 requests in 30.00s, 182.88MB read
Requests/sec:  35910.60
Transfer/sec:      6.10MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.67ms    3.17ms  31.09ms   65.51%
    Req/Sec    18.86k     3.68k   27.67k    53.46%
  1080390 requests in 30.00s, 183.40MB read
Requests/sec:  36013.33
Transfer/sec:      6.11MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.57ms    1.75ms  24.11ms   86.95%
    Req/Sec    18.71k     1.27k   22.15k    70.11%
  1076864 requests in 30.00s, 182.80MB read
Requests/sec:  35895.84
Transfer/sec:      6.09MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.56ms    2.59ms  28.95ms   86.92%
    Req/Sec    18.71k     1.16k   21.93k    76.29%
  1079171 requests in 30.00s, 183.19MB read
Requests/sec:  35972.77
Transfer/sec:      6.11MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.52ms    3.12ms  27.99ms   81.81%
    Req/Sec    18.81k     1.62k   23.80k    64.27%
  1087449 requests in 30.00s, 184.60MB read
Requests/sec:  36248.43
Transfer/sec:      6.15MB
=================== summary ===================
ghc version:  7.8.2
bench target: apiary-0.14.0.1
bench:        PARAM
bench mode:   30s * 10
average:      36050.53
stdev:        145.53
=================== oneline ===================
7.8.2,apiary-0.14.0.1,PARAM,30s,10,36050.53,145.53